node {
  name: "net_input"
  op: "Placeholder"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: -1
        }
        dim {
          size: 29
        }
        dim {
          size: 13
        }
      }
    }
  }
}
node {
  name: "net/random_uniform/shape"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\r\000\000\000<\000\000\000"
      }
    }
  }
}
node {
  name: "net/random_uniform/min"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: -0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/max"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2866911
      }
    }
  }
}
node {
  name: "net/random_uniform/RandomUniform"
  op: "RandomUniform"
  input: "net/random_uniform/shape"
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "seed"
    value {
      i: 87654321
    }
  }
  attr {
    key: "seed2"
    value {
      i: 4432094
    }
  }
}
node {
  name: "net/random_uniform/sub"
  op: "Sub"
  input: "net/random_uniform/max"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform/mul"
  op: "Mul"
  input: "net/random_uniform/RandomUniform"
  input: "net/random_uniform/sub"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/random_uniform"
  op: "Add"
  input: "net/random_uniform/mul"
  input: "net/random_uniform/min"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 13
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/kernel/Assign"
  op: "Assign"
  input: "net/kernel"
  input: "net/random_uniform"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/kernel/read"
  op: "Identity"
  input: "net/kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/kernel"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel/initial_value"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 20
          }
          dim {
            size: 60
          }
        }
        tensor_content: "\316\"\216\276\306)r\276~\372k\275\231\243[\275\004\345\032=\346\323\204=Vo\036\275`\326\323\275),\256\274\270\221\201\274\213\032\021<\376\t\277\275\245\004D\275\0017P=4\302}\276\3131\030=8\303O\276<\0270\276\252P\216\275\245;@=R\013\314;\234\3602=\3709P<4\320u\276\202\266\266\275#\331Q\276\372\002\031>\273+\262\275\035G\010=V6\030>F\010\252=*\275U=\236\026A>\367,n>\311F\202\276\234\034\321\275\265\355r>\000\214\210=\273x\255\275\306D\304==\341\215;\334\336\'>\0350\026\276q\031\026\273\037\254\003\276!!\010=\024\232\317=\005\357E>Gh\346<\220?\200=\341\334!\276\367\250\217;;3=>x\303\244\274\251\256U>\001?\262=(\346\355\272\302]\254\275\3667\245\275\200\2154\276\342<\231>\325\372\253<&\244\300\275N\037\014;\203Z\242\275FB\362\275\003\325\206=\250\2710\276sf7=T\240~>\205\324\324<a\243\226<\256\372\253=_2\002\276\213\377\275\275\345\000\346=\317\026\363=\352<\231\276?\tL>K\366\230\275W\254\325\275X\002\323\275\301\347\321=\236\277\361<\325\332\302\275G\273]\276\250\336\020\2750\260&\276d$\316=\242>\257\275\000\204\030=X\271=>8\330\266=\217p_\274\271\034\352<\303\327\364\275$\343%=F\001\014\276n\230\332\273\336\253\301\275\233K\351=\357\r\343\274:g\003\275\3048\022=\216\371`>\273\321\304\275\375\211c\274\261\t >\261/\355=\326\273\001\275\242\036\205=!*d\273\354\271\325<\254\"|\275\rLo\276\177\"\371\275\t\005]>\354\260\320=%\3305\276\010\377\226\276iq\370=]\244\324=\224h*\275R\255d=\316\217X>O\200q=\264\003\351\275L\007\376\275\276\242\026\275\321J\271=\250\0023\276\"\262\253=yy\203>\n\237\034=mJ\027\275L?\252=\212\256\200\275\2264\354<5f\244\275\246\026\201\274\323\3133=\225n4\276(s5\276-{\013>y\200>\276\330\320\270=\310\035\027>~\214\253>\302 \200\275\353\010L>&\260\223\273\003\317\031\2765\334\343<[\215\354;r2\272\275\276\212\t=0_2\271\255b\356<\230\232\033>sT\274\275!\016<\276\275\226n==Y\t=\327vT=\344\001>\276\256\311\203=\305\361\200\276\207jJ\276\323v\245=\250r\357\275\351\213Z\2745\002\331\275N\t6>\0330<\276\253\356\254<\3464\325\275,\016\026>K\260\333\274\331]\005\276\034\260|\276\261b\365=\255\337\026\275\215\231\036\275\3559w\275_\334\237>I\365F>H\207\376\275h\276i<\316\240\375\273\245\201t>\263\337Q>F\030`\276\262\352\t>\037\330\223\275\207\230\">\202\316E\276\220\020\347=\017`w=\3355\034<\367\346O\275\032\214`=x\301\204\275`1\373=\005+\230\275}@\361<DS9\276_\307\363\274\224\3639>\034\241\177\275Eh\013>Hl\024>5\232\254\274dA9\275\372\033\000\275\264^\273= \036\202\275\351\347#\275z\320\000=\346\003\257\276n\004\025<\324\234c\276\243I;\274\323\"\">\2738\036>\022\253_>7e\010\276?4W=\362d\375=\037]w\275\370!\266=\272SU\273\365\361\023\276\316\2006\2756\330\220<\203#A>kSg<\347^B\276\232\253\355\274\010\367\346\275]\227V<\213\231<\276\016\021\237>U\275L\276\227`}\276\'?\316\274\356x\037\275\373l\206>bz5=\017\336\305\274\373ai=\025\336\206\275\315\330.>\323\253\202=\025\231(\276b\031\200:\265\006=\276/\261\026\276\'\347\373<\211\372\034=Y\034,\274\n\030\253\275`9\n=O?\351\274\204#\t>$_/\276d\177\245\275<<D\275 \037\016>\214\007s>\231k\373=\032>+=\335\013\005>Yi\270\274\337\331\257=/\302:<\234K\366\275^\214\014<bf,>\013u\225=\247\003\2759}\265\026>\020{\367\274\261\3140>\225\361\320=\232\273\r\276\363C\036\276\217x}\275\335\031d=\001< <?\024\263<\273\030;=\321\275\255\274\277;\270\272\272\017)>\223\231\224\275\3312\215>ya(\275vmH\275o\273\213\276\266\223?>\210\2346\274Te\230\274 \214z=YE\230\275uI\315>}\314\211\275\rO\314\275&\324l\275)\371\245\275C+\r\276#\245I=&\224\033\276\335\264\323\275$\203W\275\231.\223\274D!9\275\340x,>.\363=\276W0\347=\257\333\235<\233\246t=u\221\032<\344\030X\276\004~/\276\266\213\254=\244}\305\275\362\326\260<\3556\360=\375\260\006>y\016\037\276\035b\214\276p\212\322=O*:=9>F>\336\245\025>\244\247\362=\374K@\275\221\234\006>\022\"\223<F\3248\275\267\315\303\274\000\026(>a\333\351\274v\005#<\\@\330\27534\225\275AN\034>\200\236\037\276\303tx\276uq7\276\363\004L\275\254\354\036=\347%\251;\231\253 \274X\235\272\276\240N\207=\300> =~\326n\275\014\240\231\275\\\030\032=\224\315\334\274\034\257M\275\254\r!>7\247\317\275\022}=\272\3041r\275\366\263\337\275\324\350e\275\314\\R>\205\003\316\275\375w\352\275\346:\341\274\017\254\027\276l\344\204>\270u\276\274/US\2761\270\275\275\\\237\346=\361\301H=j\363&\276%\027a=\341\010\270=|\"\024>\037\254\252=\244p\225\276;\247\r=\244\'j\276\010w\324\275\202\016\023>\207^\256\275\022#F\2763\341\263\275\364\366\222\275b\211\245\274\364\270\347\275m\303\361<<D\367<\274\3014\275\271M\014\276\035\005\215\276h,)\276\213\273\022\276A\221\273\275\337b9=\340\314\257\275\236d\341;\364\026\264\274\261\3439<@\2554\276pb\311:S\304*>\264~\240\275\305J\027\276:\215\227=\211\336\035<\254\224\306=\\\346\207\275^(i\273#\2244\276\333\256\253\276U\232=\276\346\367\265\2758\206\322=4\017]\275\310\265\361=%\340#<\035\006\337<\207?\003\274\355\245\374<\340\264\343=(/-\276\20257=<\260=>\210\336\212\273\354sf\276\025|\n>W\227&=5\253\200\275\216-\031;\'\340t=\024\030b\275\262\261N\276\231n\207>\372:\026>u\252\000>\214\257K\275iW\221\275\301\334\367=L=d\274\261\311\324=\022\245P\275\347\356\037\275\300\210\026\276Y\313@=}+S;b\020R>\002\263\365=\010 \374\274\334\354\222\276\360 \223\276q\313\003>\254\022y\275z\022\033<\346a\202\276\020\225\003=\345L\311<-\361D\276(\027\215=.\264\321<=[\235=\330{?\2766\325+=\232RU\275S\016a<\267\251p\276\275\3463>\316\3210\275\277\355\331\275\221iu>3\377\254=\334`!=\230p(\276\310\236\342\2739j\r\275o\360\016\276\277\233\251\275\252R{=\237F8\276\255\243\'={\365\343<\225E\336\274\301l\021=`\206\022\276s\177\223\275\301C\317\275\024y\202\276\266\212v\274\025f\312=\363\371\001>;\360\230=5\302C=Y\271X\276\331\330\226\275\310\270\021\275l\336\234>\227\235\247=\357\315_\275\0210\353\275\253\252\265=\350\326\243<>\364I=\240\032)\276\232\315*\275C\234\222<\370Q\253>6,\253\274\376.b>FW=\276\322\322\360=6|(\275\264\030A\276\266*X\275\374\024\204>G2\025\276\025\"\272\275\250\034\305\2756\237\032\275E\257\251\274[\"\353\274\310\375^\275)6\334\275a\010\365;y\245\272>\304%\r> \317s=\'\215\246\274\352\314\251\275V-\224\275\223\033\352\275d5\257\275\240\202]>\347\371\004\276O\322\362<#a\271<\350\367!\2750\234c\275\013\311\351\275c.U<\226\023\325\275tg\362=S0\026\275{\317}>\020\244Z\276\020\350I=\267\331*=\314.\340\275K\246R\275\302s\324<\027\210\340\275k\035\336\274\316\271\210\274\236\302\257\276\340\022\030=\331)\241\274y\022\244;s\240\305\274Hp\361\274\250\265&>\211`\311\275O\250\005>\034X\275\273,\220\024=|Z\364=L:O>\244\277Z\276u\341\2629\"e\264\273\233\323\035=\360\320\371=\217my\273\230\344\252\275FS#\276\345Cu\275 \260.\276r\030\027\274\255\002\214\276\325x\257>r+\372\275\271\273I=\253q\212>\0263\003>oyJ>\220(\356\275sS\314\275\237\'\251\275\017e\343=\r\037\320\274\363\020\224=\273|h\274\315B\244=\264\340\n\274ikA=`\022{>\255\257\304=\0209\r>H\234\026\275W\016\205<;\350\235\274G\354\024=\234\351\347=T\336\247=R\221?=\324\244\027>W\014\304\275l\265\246\276\326%\034\276Av\243=\302\325\372<\305\351N\276\332\2000<rs\324\275\205t\315=<\303\224\276\304sG\275\0162\311=\221\010\226<#4j<G\347\025=\305\261\006>4c)\275\355;\305\274;\230\221\275\372$>>I\315\343\275%#\300=\'\213\331\276\206[\003=\231\007k\276c\256\\\274\3171G\276E\226\327;=\027\253\275l\311\\\276,>\236<\355\200\014\276*\262z=\270\244R<\251\263\003=\346f\307=\363u\216=p\317\227=\301\207&\275_\254\024\276k[\204\275\346\227\304;\256\307\203=\357\276\035\276\277\r8>e*l=\203\301\001>vx\214=\327\337I\275\376\343\032>\022\311\010=>\336\243\275\377\3731>\213=\253<\202\367\036\275q\210E=?\001\371\275]\237\204=\315\013;>y\362\277\275\267\020\031\276\277\000\273<\303\367z\275e@]=.\312?<\330\370L>@\2525>\034Yf=\030\210\200>\311\347c\276$\234\243=\t\220\255;.3$;V\270\255\275h\006h>\023\2405\275I\'\003>mo\027\275\033\267\201>F9V\276\326,n\276\321\314B\275\346\013\336\275\364$r=\244SC>\3513\341\275\035Q\324<R\323\316\275\272\226I=\004\214\016>\226?\r\276\312D5\276\210\217:\275\0011\232=\033\033u>\034\266\243<\310\023=>\367.\345\275\260\246\214=\001\303\007\275\037\000\222\275%]\237\275\022\177B\275\216D\361=\376l,=&\037->\032\234\217\276\026\321\203\274\246\265\230\273l\325)\275?\311\256\275\356\243\266>\247\341\256<\033\031\r\276\264\263M\276\240\242\\>&O\364\275\323\342h=\335\311\337>\255\244\233\275r\222\330;f\274\225=\330j\005=v\354\233\275\310\230\206\275K\334]=\331\3452\276i\333\t>\230G\372<247\276\004\303\306=z\311\205\275\345r\031>\361z:=\201e\003\276\220\227y\273L\276\030\276\256\333\245>c\rw\274Eq\375\274\211\253\204>\217\227P=Ab\232\274\023\257\003\276b\207\276\275\261\033\263\275\204\302\350=o]\203\274/\214f\275\317\336\036\275\312\350\245\275\031\006\032>\373\375\323=t\016\001\276=$=>\301\376\232\274{a\361=G69=\366\213&<\371\265\273=\312\355P=\227\2648\275\222\372\002=\320 \314<Zsq\273\254~\273=\340\205\276=!\367\010>M\324\377<d\304\205\275\356\223`>\354R\235<\233\224\211\275:<p>&\263\201\275\030p\264\267\030\270l>\2351\210=m\027\"=\275\030\001\276\273\177\n\276\354\334\207\275\246z\236=?:\320\275J2\264=\266\033->$s|\276\260\216x=\356!*>\274Z->]$\035\275x\030d\275\323\353V=\005\3263>\244\231\303\275\324G\345\274\345\316\312;6\252}\276\341p\236\276c\242\t\275T\214\202=\240\243\366=\001\021\n\276\016\032\305\275\360\353\237>\235\204\301=D4\020\2743\357\364\275\3006\273<f\373\363\275\r\316\223=\202\364\373<\355\327C\275&$A\275\'\354\035=\360r\225\275\224\240\027>\374\005\034\276\316M\340\274\362c\230=\267\3105\276/>D\275z{R>\261\254\275\275\246\225\336\275\357\226J>+)\001\2757\371\304<\233\310\251=\370h^\275@\263\351\274U\375\265\275#\312\022\276\020\206\036\275l\027z>\340M\\=\207P+\274{\034\232=A7;\276\246\322\347=\232\r\261\275\265\337\345=\206\003\030\276 nl=\331\333C>Y\343-\273\235\315\026>\361\371\277=\023\276\335=\177\364\201\275SBY=9sk\276#:+>\'\2347\273vt\354\274-\244|\276\210>\221=\330n\346\275{hh\273m\000\264=\030\013\210>\242E\316<\367\336\035\276{\314>>\356\356\215\275\016\204\332\275\2650\270=\232\201\250\275\345\207\003>\201\215\t\276\315\032\256\276B\310T>\235\207\r>\000\234$\275\316\372\320\273H\223->\246\303f=j\237\362\274\303\0340;\367\036\265=\223\304)=@|\235\276\311\004p<\256\265\216\275\034\231o\275_\335\033\276\334],\275\257\242\237<\222^\367\274tb\342>`\364\005\276Y\301\177\275\372\333\216\275\211|A=\275\272\262\275\'M\273\275\232\245\031\275\231\022\227<\250%\302=2\205\217=\203\236\026<\2219\312=\330Q\301=\252\0007\271\004\232.\276\n]8>\346*\377=~\353\t\274\323\306\325==\'\332=\315\334\270\274z\234\\\276Pd\314<\273\177W<\226\222\201\275bZ\315\276\247\200\361<yT\033>\201H\027<\275oa>\035u\235=(\256\312=;\266\177;\021\201\231=\374\257d=VT\024<~v\202\275\212\302\225=\352\242o\276XM6>\301\3520>Vf\"\276Co\235\274\005\223\256=*\027_\275\177\227\306\274\275F\354\275\361\023\245\274\372\365S\276d\251\336=\232J\322\275\344\374\245\275\034\031\325<\230\217z\276\213\370\250<\320\241\347;\010\234\256=o\307\275\274\377B\323\274\372+(=\253^3\2764\247B\275\362\\\016>\317\022\221<\345\337.</\303\201\274L\003\263\274<\007\272=x\230\377=\247r\033\273\314\374;<J\235N\276\305\201\352\274\333\020Q\276\312\227\212\275X0\221=\235\324\236\274%GN=\353in\274mE%>\351\337\314\274\331[p>\274g\016=o\327\036\276\035\240.>G\031]\276\277S+\276}\360a\276\347=\035=\017\3416=\306!.>\2527X=2\3626\276K\262\312\2765\027\222=R\274\207\274\014\351\003\272 \307\r\275\306B\"=:\370\331=\262\242\362\275`\207\323=;r6>F|\245<\177\2131\275\345\275\223>\226\021\215\276\204\261x\275EEB<\340q\310\275\200\322Y<\375L5>\260\\\313=\341\253s=\344\244\275=K\336\030\276\207\034\362\275\177\016\005\276\254g:<W\310\200\275\232\272\255\275\371\262\375\275rt\252<\316x\227=L\200\t\276Yn\360\276{t\206=B\337\003=\314\326\356\275\276\032k\275\316D\225=\323\232\344;Y+(>\234\217\313=\340\310 =\242,\236=\332Z\325=\333\007\032>\270\n\000\276\301\232\230\276\3225\213=\377\026\203\275\2635\344:\002 \210\2751\272\215\275\226:\004=\tz\t\276R\363\200>\260\213\247\274f\\\357\275l\000)=\\\315\334=gX\317;eY\370\275\313\257\306=j\322d=\022\251\027\276\213\313\377<N\337U\275\303\336\013\276l\326,\276Ab\306==X\254=\361-d\275\242\360J\275\230r\331\275s\364;>\3669\032\276^V\241\275>\360l\276\3156\360\275J\311\314=\353x\323=n\031-\276\334l\014=\242\005-\276\267z7\276\246\320\270=\334\337\344\275:\222\245=\203\274\316\275R\320\244=Z\223\'>Lk[>\206X\002>\361\255\232=\034\334Q>\253z\014\274-\265\000<hI \276\237\025g>\305=d\275^\336\313\275hC$\275Q\302Q>\244\371\210\275\000\202N\275\274\345*=\246\350\023<\273p\277\275DC\005\275x\324\305=@\371z\276;3\026\274\242\225\274\274\3235U\276\016\023e>\330\214\025=n+1>\253\010\240\275P@\036\275%\300\260=\310\370 >\3604\255\275E\322\037<\306\316\215>D\322\023\276\243\260\372=\021\322\237=\005\267\037\276\036\331\341<$OX=U\031\235>\303\250\222<\227\205\031>\366\371\332\275\237\3454=\311\036\376=]K`\276Sb>>H\203s=+\217#\276\024 \243<\213\361\314=\037\027\256=\221\227G\275e7j=$D&\276\230\322R>{\200\207>\356\024b>\033.\373\274(\200\327\275\020C8=\335\245\231\275\263]\036>\350\020\304\274s\347\">\232dR=\271\245 =\000\231P>\200n\264=\016\217I=\322\343\205=\364^S=:4\374\274\364/\017=*B\271=B0t\276\360\020\004\276u`\351=\3051\252=\375W{\275?\323\021>r\310\360\275\\\001\266;\n\234\235>\030\247\217\274\215\371e\276A\310\321=\315V\273<\253$+=\341d\312\275R\356\355\275\276|Z>\036r\021\276m\231\001=\260\376K>\246\334V=\341\277<=\236\351K<\231\221\332=\273+\267\275\363\231\027>P)\227<\333\340q\275f\311\317\275p\317\261\275\030\212c=1O\251\275\r\362\247>\240\025\242\274\025\346\206\274\376\350\014>\231f\266=\224PQ\275\214\213?\276"
      }
    }
  }
}
node {
  name: "net/recurrent_kernel"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 20
        }
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/recurrent_kernel/Assign"
  op: "Assign"
  input: "net/recurrent_kernel"
  input: "net/recurrent_kernel/initial_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/recurrent_kernel/read"
  op: "Identity"
  input: "net/recurrent_kernel"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/recurrent_kernel"
      }
    }
  }
}
node {
  name: "net/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
          dim {
            size: 60
          }
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/bias"
  op: "VariableV2"
  attr {
    key: "container"
    value {
      s: ""
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "shape"
    value {
      shape {
        dim {
          size: 60
        }
      }
    }
  }
  attr {
    key: "shared_name"
    value {
      s: ""
    }
  }
}
node {
  name: "net/bias/Assign"
  op: "Assign"
  input: "net/bias"
  input: "net/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
  attr {
    key: "use_locking"
    value {
      b: true
    }
  }
  attr {
    key: "validate_shape"
    value {
      b: true
    }
  }
}
node {
  name: "net/bias/read"
  op: "Identity"
  input: "net/bias"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "_class"
    value {
      list {
        s: "loc:@net/bias"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice/stack"
  input: "net/strided_slice/stack_1"
  input: "net/strided_slice/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_1/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_1"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_1/stack"
  input: "net/strided_slice_1/stack_1"
  input: "net/strided_slice_1/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_2/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_2"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_2/stack"
  input: "net/strided_slice_2/stack_1"
  input: "net/strided_slice_2/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_3/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_3"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_3/stack"
  input: "net/strided_slice_3/stack_1"
  input: "net/strided_slice_3/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_4/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_4"
  op: "StridedSlice"
  input: "net/kernel/read"
  input: "net/strided_slice_4/stack"
  input: "net/strided_slice_4/stack_1"
  input: "net/strided_slice_4/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_5/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000(\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\000\000\000\000\000\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\001\000\000\000"
      }
    }
  }
}
node {
  name: "net/strided_slice_5"
  op: "StridedSlice"
  input: "net/recurrent_kernel/read"
  input: "net/strided_slice_5/stack"
  input: "net/strided_slice_5/stack_1"
  input: "net/strided_slice_5/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 3
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_6/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_6/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_6"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_6/stack"
  input: "net/strided_slice_6/stack_1"
  input: "net/strided_slice_6/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_7/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 20
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_7/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_7"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_7/stack"
  input: "net/strided_slice_7/stack_1"
  input: "net/strided_slice_7/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/strided_slice_8/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 40
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_8/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_8"
  op: "StridedSlice"
  input: "net/bias/read"
  input: "net/strided_slice_8/stack"
  input: "net/strided_slice_8/stack_1"
  input: "net/strided_slice_8/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 1
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 0
    }
  }
}
node {
  name: "net/zeros_like"
  op: "ZerosLike"
  input: "net_input"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Sum/reduction_indices"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/Sum"
  op: "Sum"
  input: "net/zeros_like"
  input: "net/Sum/reduction_indices"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tidx"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "keep_dims"
    value {
      b: false
    }
  }
}
node {
  name: "net/ExpandDims/dim"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
        }
        int_val: -1
      }
    }
  }
}
node {
  name: "net/ExpandDims"
  op: "ExpandDims"
  input: "net/Sum"
  input: "net/ExpandDims/dim"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tdim"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Tile/multiples"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 2
          }
        }
        tensor_content: "\001\000\000\000\024\000\000\000"
      }
    }
  }
}
node {
  name: "net/Tile"
  op: "Tile"
  input: "net/ExpandDims"
  input: "net/Tile/multiples"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tmultiples"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/transpose/perm"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 3
          }
        }
        tensor_content: "\001\000\000\000\000\000\000\000\002\000\000\000"
      }
    }
  }
}
node {
  name: "net/transpose"
  op: "Transpose"
  input: "net_input"
  input: "net/transpose/perm"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "Tperm"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/Shape"
  op: "Shape"
  input: "net/transpose"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/strided_slice_9/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_9"
  op: "StridedSlice"
  input: "net/Shape"
  input: "net/strided_slice_9/stack"
  input: "net/strided_slice_9/stack_1"
  input: "net/strided_slice_9/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/strided_slice_10/stack"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 0
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10/stack_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_INT32
        tensor_shape {
          dim {
            size: 1
          }
        }
        int_val: 1
      }
    }
  }
}
node {
  name: "net/strided_slice_10"
  op: "StridedSlice"
  input: "net/transpose"
  input: "net/strided_slice_10/stack"
  input: "net/strided_slice_10/stack_1"
  input: "net/strided_slice_10/stack_2"
  attr {
    key: "Index"
    value {
      type: DT_INT32
    }
  }
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "begin_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "ellipsis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "end_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "new_axis_mask"
    value {
      i: 0
    }
  }
  attr {
    key: "shrink_axis_mask"
    value {
      i: 1
    }
  }
}
node {
  name: "net/ones_like/Shape"
  op: "Shape"
  input: "net/strided_slice_10"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "out_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/ones_like/Const"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/ones_like"
  op: "Fill"
  input: "net/ones_like/Shape"
  input: "net/ones_like/Const"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "index_type"
    value {
      type: DT_INT32
    }
  }
}
node {
  name: "net/mul"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_1"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_2"
  op: "Mul"
  input: "net/strided_slice_10"
  input: "net/ones_like"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul"
  op: "MatMul"
  input: "net/mul"
  input: "net/strided_slice"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_1"
  op: "MatMul"
  input: "net/mul_1"
  input: "net/strided_slice_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_2"
  op: "MatMul"
  input: "net/mul_2"
  input: "net/strided_slice_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/BiasAdd"
  op: "BiasAdd"
  input: "net/MatMul"
  input: "net/strided_slice_6"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_1"
  op: "BiasAdd"
  input: "net/MatMul_1"
  input: "net/strided_slice_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/BiasAdd_2"
  op: "BiasAdd"
  input: "net/MatMul_2"
  input: "net/strided_slice_8"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "data_format"
    value {
      s: "NHWC"
    }
  }
}
node {
  name: "net/MatMul_3"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/MatMul_4"
  op: "MatMul"
  input: "net/Tile"
  input: "net/strided_slice_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add"
  op: "Add"
  input: "net/BiasAdd"
  input: "net/MatMul_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_3/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_3"
  op: "Mul"
  input: "net/mul_3/x"
  input: "net/add"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_1/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_1"
  op: "Add"
  input: "net/mul_3"
  input: "net/add_1/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_1"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_2"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value/Minimum"
  op: "Minimum"
  input: "net/add_1"
  input: "net/Const_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value"
  op: "Maximum"
  input: "net/clip_by_value/Minimum"
  input: "net/Const_1"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_2"
  op: "Add"
  input: "net/BiasAdd_1"
  input: "net/MatMul_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_4/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.2
      }
    }
  }
}
node {
  name: "net/mul_4"
  op: "Mul"
  input: "net/mul_4/x"
  input: "net/add_2"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_3/y"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.5
      }
    }
  }
}
node {
  name: "net/add_3"
  op: "Add"
  input: "net/mul_4"
  input: "net/add_3/y"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/Const_3"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 0.0
      }
    }
  }
}
node {
  name: "net/Const_4"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/clip_by_value_1/Minimum"
  op: "Minimum"
  input: "net/add_3"
  input: "net/Const_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/clip_by_value_1"
  op: "Maximum"
  input: "net/clip_by_value_1/Minimum"
  input: "net/Const_3"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_5"
  op: "Mul"
  input: "net/clip_by_value_1"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/MatMul_5"
  op: "MatMul"
  input: "net/mul_5"
  input: "net/strided_slice_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "transpose_a"
    value {
      b: false
    }
  }
  attr {
    key: "transpose_b"
    value {
      b: false
    }
  }
}
node {
  name: "net/add_4"
  op: "Add"
  input: "net/BiasAdd_2"
  input: "net/MatMul_5"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_6"
  op: "Mul"
  input: "net/clip_by_value"
  input: "net/Tile"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/sub/x"
  op: "Const"
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "value"
    value {
      tensor {
        dtype: DT_FLOAT
        tensor_shape {
        }
        float_val: 1.0
      }
    }
  }
}
node {
  name: "net/sub"
  op: "Sub"
  input: "net/sub/x"
  input: "net/clip_by_value"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/mul_7"
  op: "Mul"
  input: "net/sub"
  input: "net/add_4"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/add_5"
  op: "Add"
  input: "net/mul_6"
  input: "net/mul_7"
  attr {
    key: "T"
    value {
      type: DT_FLOAT
    }
  }
}
node {
  name: "net/TensorArray"
  op: "TensorArrayV3"
  input: "net/strided_slice_9"
  attr {
    key: "clear_after_read"
    value {
      b: true
    }
  }
  attr {
    key: "dtype"
    value {
      type: DT_FLOAT
    }
  }
  attr {
    key: "dynamic_size"
    value {
      b: false
    }
  }
  attr {
    key: "element_shape"
    value {
      shape {
        unknown_rank: true
      }
    }
  }
  attr {
    key: "identical_element_shapes"
    value {
      b: true
    }
  }
